Documents/упРегистрацияОтложенныхРаботПоРейсу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упРегистрацияОтложенныхРаботПоРейсу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упРасписаниеРаботыТС</xr:Item>
				<xr:Item>InformationRegister.упМаршрутПоРейсу</xr:Item>
				<xr:Item>InformationRegister.упУчетныеПараметрыТранспортныхСредств</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
				<xr:Item>InformationRegister.упСтатусыРейсов</xr:Item>
				<xr:Item>InformationRegister.упРаботыПоРейсу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСозданияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упИсточникиСозданияОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/упРегистрацияОтложенныхРаботПоРейсу/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Формируется или открывается существующий документ "Регистрация отложенных работ по рейсу" на основании рейса 
//
// Параметры:
//  Рейс  - ДокументСсылка.упРейс - Ссылка на документ.
//  ТекстОшибки  - Строка - Текстовое представлениеошибки.
//  Отказ  - Булево - Флаг что произошел отказ создания движения.
//
// Возвращаемое значение:
//   ДокументСсылка   - Ссылка на документ.
//
Функция СформироватьРегистрацияОтложенныхРаботПоРейсу(Рейс, ТекстОшибки = Неопределено, Отказ) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	упРегистрацияОтложенныхРаботПоРейсу.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.упРегистрацияОтложенныхРаботПоРейсу КАК упРегистрацияОтложенныхРаботПоРейсу
	|ГДЕ
	|	упРегистрацияОтложенныхРаботПоРейсу.Рейс = &Рейс
	|	И НЕ упРегистрацияОтложенныхРаботПоРейсу.ПометкаУдаления";
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе	
		НовыйДокумент = Документы.упРегистрацияОтложенныхРаботПоРейсу.СоздатьДокумент();
		НовыйДокумент.Автор = ПользователиКлиентСервер.ТекущийПользователь();
		НовыйДокумент.ИсточникСозданияОбъекта = упСервисныеФункцииКлиентСервер.ИсточникСозданияОбъекта();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Рейс = Рейс;
		НовыйДокумент.Заполнить(Рейс);
		НовыйДокумент.ДополнительныеСвойства.Вставить("ВыводитьСообщенияПользователю", Ложь);
		Попытка
			НовыйДокумент.Записать();
			Результат = НовыйДокумент.Ссылка;
		Исключение
			ТекстОшибкиДляЖР = "";
			Отказ = Истина;
			упСервисныеФункции.ПредставленияОписанияОшибки(НовыйДокумент, ТекстОшибки, ТекстОшибкиДляЖР);
			ЗаписьЖурналаРегистрации(упКорректировкаМаршрута.СобытиеОшибкаРегистрацияОтложенныхРаботПоРейсу(НСтр("ru = 'Добавление'")), УровеньЖурналаРегистрации.Ошибка, ,Рейс, ТекстОшибкиДляЖР, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		КонецПопытки;
	КонецЕсли; 
	
	Возврат Результат;	
	
КонецФункции // СформироватьРегистрацияЗадолженностиПоДокументамРейса()

#КонецОбласти

#КонецЕсли
